In [1]:
import pandas as pd
import numpy as np

# 테이블 데이터

In [2]:
x = {
    'city': ['부산', '부산', '부산', '부산', '서울', '서울', '서울'],
    'fruits': ['apple', 'orange', 'banana', 'banana', 'apple', 'apple', 'banana'],
    'price': [100, 200, 250, 300, 150, 200, 400],
    'quantity': [1, 2, 3, 4, 5, 6, 7]
}
df = pd.DataFrame(x)
df

  city  fruits  price  quantity
0   부산   apple    100         1
1   부산  orange    200         2
2   부산  banana    250         3
3   부산  banana    300         4
4   서울   apple    150         5
5   서울   apple    200         6
6   서울  banana    400         7

# groupby

In [6]:
# 같은 값을 하나로 묶어 통계 또는 집계 결과를 얻기 위해 사용하는 것이 groupby

df1 = df.groupby('city').sum()
df1

      price  quantity
city
부산      850        10
서울      750        18

In [7]:
# 도시(city) 별로 가격(price) 평균을 구하고 싶은 경우|
df2 = df.groupby(['city', 'fruits']).mean()
df2

             price  quantity
city fruits
부산   apple   100.0       1.0
     banana  275.0       3.5
     orange  200.0       2.0
서울   apple   175.0       5.5
     banana  400.0       7.0

In [8]:
df2.index

MultiIndex([('부산',  'apple'),
            ('부산', 'banana'),
            ('부산', 'orange'),
            ('서울',  'apple'),
            ('서울', 'banana')],
           names=['city', 'fruits'])

In [9]:
# groupby를 사용하면 기본으로 그룹 라벨이 index가 된다
# index를 사용하고 싶은 않은 경우에는 as_index=False 설정

df3 = df.groupby(['city', 'fruits'], as_index=False).sum()
df3

  city  fruits  price  quantity
0   부산   apple    100         1
1   부산  banana    550         7
2   부산  orange    200         2
3   서울   apple    350        11
4   서울  banana    400         7

In [10]:

df4 = df3[['city', 'fruits']]
df4

  city  fruits
0   부산   apple
1   부산  banana
2   부산  orange
3   서울   apple
4   서울  banana

## Aggregation

- GroupBy.mean()처럼 그룹별로 결과를 얻는 조작을 Aggregation이라고 한다
- agg()를 사용

In [13]:
df.groupby('city').agg((np.sum, np.mean, np.size
                       ))

     price             quantity
       sum   mean size      sum mean size
city
부산     850  212.5    4       10  2.5    4
서울     750  250.0    3       18  6.0    3

In [16]:
# 사용자 함수를 사용하는 경우
def my_mean(s):
    return np.mean(s)*100

df.groupby('city').agg((np.sum, my_mean))
# df.groupby('city').agg({'price': my_mean, 'quantity': np.sum})

      price  quantity
city
부산    21250        10
서울    25000        18

In [17]:
df

  city  fruits  price  quantity
0   부산   apple    100         1
1   부산  orange    200         2
2   부산  banana    250         3
3   부산  banana    300         4
4   서울   apple    150         5
5   서울   apple    200         6
6   서울  banana    400         7

In [18]:
df.groupby(['city', 'fruits'], as_index=False).apply(lambda d: (d.price * d.quantity).sum())

city  fruits
부산    apple      100
      banana    1950
      orange     400
서울    apple     1950
      banana    2800
dtype: int64

# apply, lambda

In [19]:
x = np.arange(24).reshape(6,4)
dd = pd.DataFrame(x); dd

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19
5  20  21  22  23

In [20]:
dd.apply(lambda x: x.mean())
dd.apply(np.mean)

0    10.0
1    11.0
2    12.0
3    13.0
dtype: float64